<template>
     <div class="wrap">
        <v-header></v-header>
        <v-title-header :backLink="backLink">
            姓名大全
        </v-title-header>
        <div class="artical-header">
            <h2>{{itemTitle}}</h2>
            <div class="time">时间：{{upTime}}</div>
        </div>
        <div class="content-wrap">
            <div class="item-message">                    
                <p v-html="itemArtical"></p>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {
            backLink: '/nameHome',
            itemTitle:  "三才配置吉凶表怎么看",
            upTime: "2016-10-03 16:57:50",
            itemArtical: "这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容这里是文章内容",
        }
    }
}
</script>
<style lang="less" scoped>
.artical-header{
        padding: 30/75rem;
        text-align: center;
        background: #fff;
        border-bottom: 1px solid rgba(0,0,0,0.1);
        & > h2{
            font-size: 32/75rem;
            margin-bottom: 16/75rem;
        }      
    }
.content-wrap{
   position: absolute;
    top: 383/75rem;
    bottom: 0;
    left: 0;
    width: 100%;
    overflow: auto;
    .item-message{
        width: 100%;
        border-bottom: 1px solid rgba(0,0,0,0.1);
        padding: 32/75rem 0;
        & > p{
            text-indent: 2em;
            font-size: 24/75rem;
            padding:  0 32/75rem;
        } 
    }
}
</style>